{
  "aboutMe": "​Hi! My name is Mariana and I'm 26 years old. I live in a nice city, called Christchurch! And yes' I live near Rohan! As you can see, I'm a fan of Lord of the Rings! What other reason is there to live in New Zealand? I'm joking, this country is really beautiful and I love living here. My other passion is American Football. My favorite team is Seattle Seahawks. Anyway, now I live in New Zealand, so I like Rugby, too and for me, Richie Mo'unga is the best player EVER!. My favorite team are the Crusaders and their uniform is really pretty. My hobbies include reading adventure and dystopian books and building something using Lego. I can't live without music. I use music to relax or listen to it while programmming or coooking. I've studied History at the Fluminense Federal University,in Rio.\nHowever, during the bachelor, I realized that the impact of my work in society didn't satisfy me. So, I decided to try something completely different and I have no regrets about it. I discovered that my passion for Front-end development could be my profession in the future. Although I still enjoy reading about History, currently I am in love with the front-end development. My current studies are more about Front-End accessibility technologies. One of my greatest strengths is my ability to devote myself deeply to something and I am looking for opportunities to share my knowledge and to show my work. I believe the web must be accessible for everybody and in the future, I want to be one of the developers who helped to create an inclusive web using my Front-end knowledge.",
  "location": "Christchurch, New Zealand",
  "email": "marianamartinsmenezes@gmail.com",
  "socialMedia": [
    {
      "name": "Mariana's Facebook profile",
      "url": "https://www.facebook.com/x2003k",
      "type" : "facebook"
    },
    {
      "name": "Mariana's Github profile",
      "url": "https://github.com/mariana-martins",
      "type" : "github"
    },
    {
      "name": "Mariana's LinkedIn profile",
      "url": "https://www.linkedin.com/in/marianamenezes",
      "type" : "linkedin"
    }
  ]
}
